package ch01;

public class MainTest1 {

	public static void main(String[] args) {
	
		// 무엇이든 담을 수 있는 제네릭 프로그래밍
		// 5.0 이후부터 나옴
		
		// 제네릭 프로그래밍을 사용하는 이유
		// 우리가 변수를 사용한다고 하면 변수에 항상 자료형을 먼저 지정하게 되어 있다.
		// 하지만 같은 변수 이름이고 데이터 타입만 달라지는 경우를 만난다면
		//제니릭 프로그래밍을 생각 하자!!
		
		// ex) 
		// double result;
		// int result;
		// float result; 하나의 변수 타입에 선언할 수 없다.
		// --> a.java b.java c.java <--- 따로 만들어야 한다.
		// 제네릭을 이용하면 위와 같은 상황을 해결 할 수 있다.
		
		//결론
		//다양한 자료형이 적용될 수 있는 클래스를 만드는 것이
		//제네릭 프로그래밍 방식이라고 한다.
		
	}
}
